app/controllers/bookings_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 114], ["LIMIT", 1]]
---
  def create
    @booking = Booking.new(booking_params)
    @room = Room.find(params[:room_id])