app/controllers/hotels_controller.rb

    def index
      @hotels = Hotel.where(country: params[:country])
---
SELECT "hotels".* FROM "hotels" WHERE "hotels"."country" IS NULL

  def show
      @hotels = Hotel.where(country: params[:country])
---
SELECT "hotels".* FROM "hotels" WHERE "hotels"."country" = $1  [["country", "🇷🇪La Réunion"]]