app/controllers/rooms_controller.rb

SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."hotel_id" = $1  [["hotel_id", 31]]
---
  def index
    @hotel = Hotel.find(params[:hotel_id])
    @rooms = Room.where(hotel_id: params[:hotel_id])

SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 91], ["LIMIT", 1]]
---
  def show
    @hotel = Hotel.find(params[:hotel_id])
    @room = Room.find(params[:id])