app/views/hotels/index.html.erb

      <%= form_tag hotels_path, method: :get, class: 'filtrepays' do %>
      <%= select_tag :country, options_for_select(Hotel.pluck(:country).uniq) %>
---
SELECT "hotels"."country" FROM "hotels"